%-------------------------------------------------------------------------------
% Параметры стрельбы
%-------------------------------------------------------------------------------

% начальная скорость снаряда
v0 = 400; 
% угол наклона ствола пушки к горизонту
alpha = 35 * pi / 180; 

%-------------------------------------------------------------------------------
% Начальные условия
%-------------------------------------------------------------------------------
x0 = 0;
y0 = 0;
vx0 = v0 * cos(alpha);
vy0 = v0 * sin(alpha);

Y0 = [x0; y0; vx0; vy0];

%-------------------------------------------------------------------------------
% Параметры временного интервала
%-------------------------------------------------------------------------------

% начальный момент времени
t0 = 0;
% конечный момент времени
tend = 47.0;
% шаг выдачи решения
deltaT = 0.1;

% Массив интересующих нас моментов времени
t = [t0:deltaT:tend];

% Интрегрируем систему уравнений движения
Y = lsode("f_vac", Y0, t);

%-------------------------------------------------------------------------------
% Параметры снаряда
%-------------------------------------------------------------------------------

% плотность материала снаряда
global gamma = 7800; 
% коэффициент сопростивления формы (для шара)
global c_f = 0.47;
% калибр
global d = 0.1;

% Интегрируем систему уравнений движения 
Y_air = lsode("f_air", Y0, t);

% Строим обе траектории
%plot(Y_air(:,1), Y_air(:,2), Y(:,1), Y(:,2));
plot(Y_air(:,1), Y_air(:,2));

% Задаем пределы отображения графиков по осям координт
xmin = 0;
xmax = 3000;
ymin = 0;
ymax = 900;

axis([xmin xmax ymin ymax]);

% Задаем масштаб по осям
set(gca,'dataaspectratio',[1 1 1]);

